// 24. Вывести на экран таблицу квадратов чисел от 1 до N
/*
for (int i=0; i<=N; i++)
{
    Console.WriteLine($"{i}^2 = " + Math.Pow(i,2));
}
*/
for (int i=1; i<=9; i++)
{
    Console.WriteLine($"{i}^2 = " + Math.Pow(i,2));
}
